# Реализуйте метод checkArray(Integer[] arr), принимающий в качестве аргумента целочисленный одномерный массив.
# Метод должен пройтись по каждому элементу и проверить что он не равен null.
# А теперь реализуйте следующую логику:
# Если в какой-то ячейке встретился null, то необходимо “оповестить” об этом пользователя
# Если null’ы встретились в нескольких ячейках, то идеально было бы все их “подсветить”

def check_array(arr):
    for i in range(len(arr)):
        if arr[i] is None:
            print(f"Внимание! Пустой элемент на позиции {i + 1}!")
        elif isinstance(arr[i], int):
            print(f' Не целое число на позиции {i + 1}!')


array = [1, 2.2, None, 4, None]
check_array(array)