# Напишите приложение, которое будет запрашивать у пользователя следующие данные
# в произвольном порядке, разделенные пробелом:
# Фамилия Имя Отчество датарождения номертелефона пол
# Форматы данных:
# фамилия, имя, отчество - строки
# дата_рождения - строка формата dd.mm.yyyy
# номер_телефона - целое беззнаковое число без форматирования
# пол - символ латиницей f или m.
# Приложение должно проверить введенные данные по количеству. Если количество не совпадает с требуемым,
# вернуть код ошибки, обработать его и показать пользователю сообщение, что он ввел меньше и больше данных,
# чем требуется.
# Приложение должно попытаться распарсить полученные значения и выделить из них требуемые параметры.
# Если форматы данных не совпадают, нужно бросить исключение, соответствующее типу проблемы.
# Можно использовать встроенные типы java и создать свои. Исключение должно быть корректно обработано,
# пользователю выведено сообщение с информацией, что именно неверно.
# Если всё введено и обработано верно, должен создаться файл с названием, равным фамилии, в него в одну
# строку должны записаться полученные данные, вида
# <Фамилия><Имя><Отчество><датарождения> <номертелефона><пол>
# Однофамильцы должны записаться в один и тот же файл, в отдельные строки.
# Не забудьте закрыть соединение с файлом.
# При возникновении проблемы с чтением-записью в файл, исключение должно быть корректно обработано,
# пользователь должен увидеть стектрейс ошибки.
# 89217730009 Antonov Alevtin Ivanovich 19.03.1964 m
from custom_error_classes import *
from split_input_string import split_input_string
from looking_for_male import looking_for_male
from looking_for_date import looking_for_date
from looking_for_phone import looking_for_phone



while True:

    input_string = input('Введите следующие данные в произвольном порядке, разделенные пробелом:\n'
                         'фамилия имя отчество - не меняя порядок ФИО\n'
                         'дата_рождения - строка формата dd.mm.yyyy\n'
                         'номер_телефона - целое беззнаковое число без форматирования\n'
                         'пол - символ латиницей f или m : \n').split()

    # print(input_string)

    try:
        if len(input_string) < 6:
            raise NumberOfInputDataWrongError(f'ОШИБКА! Количество данных = {len(input_string)} -> меньше требуемых 6\n'
                                              'Попробуйте ввести ещё раз\n')
        elif len(input_string) > 6:
            raise NumberOfInputDataWrongError(f'ОШИБКА! Количество данных = {len(input_string)} -> больше требуемых 6\n'
                                              'Попробуйте ввести ещё раз\n')

        looking_for_male(input_string)
        looking_for_date(input_string)
        looking_for_date(input_string)
        looking_for_phone(input_string)

    except NumberOfInputDataWrongError as e:
        print(e)
    except MaleNotEnteredError as e:
        print(e)
    except DateInputError as e:
        print(e)
    except PhoneNumberInputError as e:
        print(e)

    else:
        split_input_string(input_string)
        break

